
#просто число #################################
# while True:
#     num = int(input('Введите число? '))
#     while num < 0:
#         print('Число меньше нуля')
#         num = int(input('Введите число? '))
            
#     if num > 1:
#         for i in range(2, num//2):
#             if (num % i) == 0:
#                 print("Число не простое")
#                 break
#         else:
#             print(num, "Число простое")
#     else: 
#         print(num, "Число не простое")
###############################################

#нод ##########################################
# a = int(input("Введите первое число = "))
# b = int(input("Введите второе число = "))

# while a != 0 and b != 0:
#     if a > b:
#         a %= b
#     else:
#         b %= a

# gcd = a + b
# print(f"Наибольший общий делитель = {gcd}")
###############################################

#нок ##########################################
# def lcm(a, b):
#     m = a * b
#     while a != 0 and b != 0:
#         if a > b:
#             a %= b
#             print(a)            
#         else:
#             b %= a
#             print(b)
#     return m // (a + b)


# while True:
#     try:
#         x = int(input('Введите первое число = '))
#         y = int(input('Введите второе число = '))
#         print('Наименьшее общее кратное = ', lcm(x, y))
#     except ValueError:
#         break
###############################################